package collections;

/**
 * Реализация структуры данных "Куча с приоритетами"
 * Описание:
 * Создайте класс PriorityQueueCustom, который будет реализовывать функциональность очереди с
 * приоритетами. Ваша реализация должна поддерживать следующие операции:
 * insert(T element, int priority) - добавляет элемент с заданным приоритетом.
 * T extractMax() - удаляет и возвращает элемент с наивысшим приоритетом.
 * T peekMax() - возвращает элемент с наивысшим приоритетом, не удаляя его.
 * boolean isEmpty() - проверяет, пуста ли очередь.
 * Условия:
 * Используйте массивы или коллекции для хранения элементов.
 * Обеспечьте логарифмическое время выполнения для операций insert и extractMax.
 */
public class PriorityQueque {
}
